UTAF_Base/Reports/20_12_21_18_39_02/202112201839039396294956217044.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://api.web.bc/api/schema/commoncontext/transaction/v1" xmlns:v11="http://api.web.bc/api/schema/commoncontext/consumertransaction/v1" xmlns:v12="http://api.web.bc/capability/business/b182-01/services/person/flv000568/v1" xmlns:v13="http://api.web.bc/capability/business/b182-01/objects/requestgetpersonlist/flv000568/v1" xmlns:v2="http://api.web.bc/api/schema/commoncontext/v2">
<soapenv:Header>
<v2:CommonContextRequest>
<v2:transaction>
<v1:messageId>234299583</v1:messageId>
<v1:conversationId>234299583</v1:conversationId>
<v1:dateTimeCreated>2021-12-20</v1:dateTimeCreated>
</v2:transaction>
</v2:CommonContextRequest>
</soapenv:Header>
<soapenv:Body>
<v12:RequestDataGetPersonList>
<v12:serviceContext>
<v12:transactionData>
<v12:endUserId>609496301</v12:endUserId>
<v12:endUserLanguage>EN</v12:endUserLanguage>
<v12:consumerApplication>SHE</v12:consumerApplication>
</v12:transactionData>
</v12:serviceContext>
<v12:serviceData>
<v12:personIdentifier>
<v13:id>temp_ExtPartyId_1</v13:id>
<v13:idScope>
<v13:value>ENT</v13:value>
</v13:idScope>
<v13:idContext>
<v13:value>B182</v13:value>
</v13:idContext>
</v12:personIdentifier>
<v12:personIdentifier>
<v13:id>temp_ExtPartyId_1</v13:id>
</v12:personIdentifier>
</v12:serviceData>
</v12:RequestDataGetPersonList>
</soapenv:Body>
</soapenv:Envelope>
